Revit 2024 API
Rectangle.IsNormalized Method
 Returns true if the rectangle coordinates are normalized to the screen coordinate space; that is, left is less than right and top is less than bottom.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool IsNormalized()
Visual Basic
Public Function IsNormalized As Boolean
Visual C++
public:
bool IsNormalized()
See Also
Rectangle Class
Autodesk.Revit.DB Namespace